UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples/boostxl_afe031_f28004x_rx/boostxl_afe031_f28004x_rx_isr.h
#if (INT3PL >= INT14PL) || (INT3PL == 0)
#define  MINT14_3PL    ~(1 << 2)
#else
#define  MINT14_3PL    0xFFFF
#endif

#if (INT4PL >= INT14PL) || (INT4PL == 0)
#define  MINT14_4PL    ~(1 << 3)
#else
#define  MINT14_4PL    0xFFFF
#endif

#if (INT5PL >= INT14PL) || (INT5PL == 0)
#define  MINT14_5PL    ~(1 << 4)
#else
#define  MINT14_5PL    0xFFFF
#endif

#if (INT6PL >= INT14PL) || (INT6PL == 0)
#define  MINT14_6PL    ~(1 << 5)
#else
#define  MINT14_6PL    0xFFFF
#endif

#if (INT7PL >= INT14PL) || (INT7PL == 0)
#define  MINT14_7PL    ~(1 << 6)
#else
#define  MINT14_7PL    0xFFFF
#endif

#if (INT8PL >= INT14PL) || (INT8PL == 0)
#define  MINT14_8PL    ~(1 << 7)
#else
#define  MINT14_8PL    0xFFFF
#endif

#if (INT9PL >= INT14PL) || (INT9PL == 0)
#define  MINT14_9PL    ~(1 << 8)
#else
#define  MINT14_9PL    0xFFFF
#endif

#if (INT10PL >= INT14PL) || (INT10PL == 0)
#define  MINT14_10PL    ~(1 << 9)
#else
#define  MINT14_10PL    0xFFFF
#endif

#if (INT11PL >= INT14PL) || (INT11PL == 0)
#define  MINT14_11PL    ~(1 << 10)
#else
#define  MINT14_11PL    0xFFFF
#endif

#if (INT12PL >= INT14PL) || (INT12PL == 0)
#define  MINT14_12PL    ~(1 << 11)
#else
#define  MINT14_12PL    0xFFFF
#endif

#if (INT13PL >= INT14PL) || (INT13PL == 0)
#define  MINT14_13PL    ~(1 << 12)
#else
#define  MINT14_13PL    0xFFFF
#endif

#define  MINT14_14PL    ~(1 << 13)

#if (INT15PL >= INT14PL) || (INT15PL == 0)
#define  MINT14_15PL    ~(1 << 14)
#else
#define  MINT14_15PL    0xFFFF
#endif

#if (INT16PL >= INT14PL) || (INT16PL == 0)
#define  MINT14_16PL    ~(1 << 15)
#else
#define  MINT14_16PL    0xFFFF
#endif

#define  MINT14    (MINT14_1PL  & MINT14_2PL  & MINT14_3PL  & MINT14_4PL  & \
                   MINT14_5PL  & MINT14_6PL  & MINT14_7PL  & MINT14_8PL  & \
                   MINT14_9PL  & MINT14_10PL & MINT14_11PL & MINT14_12PL & \
                   MINT14_13PL & MINT14_14PL & MINT14_15PL & MINT14_16PL)
// End Of MINT14.

// Beginning of MINT15:
#if (INT1PL >= INT15PL) || (INT1PL == 0)
#define  MINT15_1PL    ~(1 << 0)
#else
#define  MINT15_1PL    0xFFFF
#endif

#if (INT2PL >= INT15PL) || (INT2PL == 0)
#define  MINT15_2PL    ~(1 << 1)
#else
#define  MINT15_2PL    0xFFFF
#endif

#if (INT3PL >= INT15PL) || (INT3PL == 0)
#define  MINT15_3PL    ~(1 << 2)
#else
#define  MINT15_3PL    0xFFFF
#endif

#if (INT4PL >= INT15PL) || (INT4PL == 0)
#define  MINT15_4PL    ~(1 << 3)
#else
#define  MINT15_4PL    0xFFFF
#endif

#if (INT5PL >= INT15PL) || (INT5PL == 0)
#define  MINT15_5PL    ~(1 << 4)
#else
#define  MINT15_5PL    0xFFFF
#endif

#if (INT6PL >= INT15PL) || (INT6PL == 0)
#define  MINT15_6PL    ~(1 << 5)
#else
#define  MINT15_6PL    0xFFFF
#endif

#if (INT7PL >= INT15PL) || (INT7PL == 0)
#define  MINT15_7PL    ~(1 << 6)
#else
#define  MINT15_7PL    0xFFFF
#endif

#if (INT8PL >= INT15PL) || (INT8PL == 0)
#define  MINT15_8PL    ~(1 << 7)
#else
#define  MINT15_8PL    0xFFFF
#endif

#if (INT9PL >= INT15PL) || (INT9PL == 0)
#define  MINT15_9PL    ~(1 << 8)
#else
#define  MINT15_9PL    0xFFFF
#endif

#if (INT10PL >= INT15PL) || (INT10PL == 0)
#define  MINT15_10PL    ~(1 << 9)
#else
#define  MINT15_10PL    0xFFFF
#endif

#if (INT11PL >= INT15PL) || (INT11PL == 0)
#define  MINT15_11PL    ~(1 << 10)
#else
#define  MINT15_11PL    0xFFFF
#endif

#if (INT12PL >= INT15PL) || (INT12PL == 0)
#define  MINT15_12PL    ~(1 << 11)
#else
#define  MINT15_12PL    0xFFFF
#endif

#if (INT13PL >= INT15PL) || (INT13PL == 0)
#define  MINT15_13PL    ~(1 << 12)
#else
#define  MINT15_13PL    0xFFFF
#endif

#if (INT14PL >= INT15PL) || (INT14PL == 0)
#define  MINT15_14PL    ~(1 << 13)
#else
#define  MINT15_14PL    0xFFFF
#endif

#define  MINT15_15PL    ~(1 << 14)

#if (INT16PL >= INT15PL) || (INT16PL == 0)
#define  MINT15_16PL    ~(1 << 15)
#else
#define  MINT15_16PL    0xFFFF
#endif

#define  MINT15    (MINT15_1PL  & MINT15_2PL  & MINT15_3PL  & MINT15_4PL  & \
                   MINT15_5PL  & MINT15_6PL  & MINT15_7PL  & MINT15_8PL  & \
                   MINT15_9PL  & MINT15_10PL & MINT15_11PL & MINT15_12PL & \
                   MINT15_13PL & MINT15_14PL & MINT15_15PL & MINT15_16PL)
// End Of MINT15.

// Beginning of MINT16:
#if (INT1PL >= INT16PL) || (INT1PL == 0)
#define  MINT16_1PL    ~(1 << 0)
#else
#define  MINT16_1PL    0xFFFF
#endif

#if (INT2PL >= INT16PL) || (INT2PL == 0)
#define  MINT16_2PL    ~(1 << 1)
#else
#define  MINT16_2PL    0xFFFF
#endif

#if (INT3PL >= INT16PL) || (INT3PL == 0)
#define  MINT16_3PL    ~(1 << 2)
#else
#define  MINT16_3PL    0xFFFF
#endif

#if (INT4PL >= INT16PL) || (INT4PL == 0)
#define  MINT16_4PL    ~(1 << 3)
#else
#define  MINT16_4PL    0xFFFF
#endif

#if (INT5PL >= INT16PL) || (INT5PL == 0)
#define  MINT16_5PL    ~(1 << 4)
#else
#define  MINT16_5PL    0xFFFF
#endif

#if (INT6PL >= INT16PL) || (INT6PL == 0)
#define  MINT16_6PL    ~(1 << 5)
#else
#define  MINT16_6PL    0xFFFF
#endif

#if (INT7PL >= INT16PL) || (INT7PL == 0)
#define  MINT16_7PL    ~(1 << 6)
#else
#define  MINT16_7PL    0xFFFF
#endif

#if (INT8PL >= INT16PL) || (INT8PL == 0)
#define  MINT16_8PL    ~(1 << 7)
#else
#define  MINT16_8PL    0xFFFF
#endif

#if (INT9PL >= INT16PL) || (INT9PL == 0)
#define  MINT16_9PL    ~(1 << 8)
#else
#define  MINT16_9PL    0xFFFF
#endif

#if (INT10PL >= INT16PL) || (INT10PL == 0)
#define  MINT16_10PL    ~(1 << 9)
#else
#define  MINT16_10PL    0xFFFF
#endif

#if (INT11PL >= INT16PL) || (INT11PL == 0)
#define  MINT16_11PL    ~(1 << 10)
#else
#define  MINT16_11PL    0xFFFF
#endif

#if (INT12PL >= INT16PL) || (INT12PL == 0)
#define  MINT16_12PL    ~(1 << 11)
#else
#define  MINT16_12PL    0xFFFF
#endif

#if (INT13PL >= INT16PL) || (INT13PL == 0)
#define  MINT16_13PL    ~(1 << 12)
#else
#define  MINT16_13PL    0xFFFF
#endif

#if (INT14PL >= INT16PL) || (INT14PL == 0)
#define  MINT16_14PL    ~(1 << 13)
#else
#define  MINT16_14PL    0xFFFF
#endif

#if (INT15PL >= INT16PL) || (INT15PL == 0)
#define  MINT16_15PL    ~(1 << 14)
#else
#define  MINT16_15PL    0xFFFF
#endif

#define  MINT16_16PL    ~(1 << 15)

#define  MINT16    (MINT16_1PL  & MINT16_2PL  & MINT16_3PL  & MINT16_4PL  & \
                   MINT16_5PL  & MINT16_6PL  & MINT16_7PL  & MINT16_8PL  & \
                   MINT16_9PL  & MINT16_10PL & MINT16_11PL & MINT16_12PL & \
                   MINT16_13PL & MINT16_14PL & MINT16_15PL & MINT16_16PL)
// End Of MINT16.

//
// Automatically generate PIEIER1 interrupt masks MG11 to MG116:
//

// Beginning of MG11:
#if (G1_2PL >= G1_1PL) || (G1_2PL == 0)
#define  MG1_1_12PL    ~(1 << 1)
#else
#define  MG1_1_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_1PL) || (G1_3PL == 0)
#define  MG1_1_13PL    ~(1 << 2)
#else
#define  MG1_1_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_1PL) || (G1_4PL == 0)
#define  MG1_1_14PL    ~(1 << 3)
#else
#define  MG1_1_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_1PL) || (G1_5PL == 0)
#define  MG1_1_15PL    ~(1 << 4)
#else
#define  MG1_1_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_1PL) || (G1_6PL == 0)
#define  MG1_1_16PL    ~(1 << 5)
#else
#define  MG1_1_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_1PL) || (G1_7PL == 0)
#define  MG1_1_17PL    ~(1 << 6)
#else
#define  MG1_1_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_1PL) || (G1_8PL == 0)
#define  MG1_1_18PL    ~(1 << 7)
#else
#define  MG1_1_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_1PL) || (G1_9PL == 0)
#define  MG1_1_19PL    ~(1 << 8)
#else
#define  MG1_1_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_1PL) || (G1_10PL == 0)
#define  MG1_1_110PL    ~(1 << 9)
#else
#define  MG1_1_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_1PL) || (G1_11PL == 0)
#define  MG1_1_111PL    ~(1 << 10)
#else
#define  MG1_1_111PL    0xFFFF
#endif

