UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples/boostxl_afe031_f28004x_rx/boostxl_afe031_f28004x_rx_isr.h
#if (G1_12PL >= G1_7PL) || (G1_12PL == 0)
#define  MG1_7_112PL    ~(1 << 11)
#else
#define  MG1_7_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_7PL) || (G1_13PL == 0)
#define  MG1_7_113PL    ~(1 << 12)
#else
#define  MG1_7_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_7PL) || (G1_14PL == 0)
#define  MG1_7_114PL    ~(1 << 13)
#else
#define  MG1_7_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_7PL) || (G1_15PL == 0)
#define  MG1_7_115PL    ~(1 << 14)
#else
#define  MG1_7_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_7PL) || (G1_16PL == 0)
#define  MG1_7_116PL    ~(1 << 15)
#else
#define  MG1_7_116PL    0xFFFF
#endif

#define  MG1_7_17PL	0xFFBF
#define  MG1_7    (MG1_7_11PL & MG1_7_12PL & MG1_7_13PL & MG1_7_14PL & \
                    MG1_7_15PL & MG1_7_16PL & MG1_7_17PL & MG1_7_18PL & \
                    MG1_7_19PL & MG1_7_110PL & MG1_7_111PL & MG1_7_112PL & \
                    MG1_7_113PL & MG1_7_114PL & MG1_7_115PL & MG1_7_116PL)
// End of MG1_7:
// Beginning of MG18:
#if (G1_1PL >= G1_8PL) || (G1_1PL == 0)
#define  MG1_8_11PL    ~(1 << 0)
#else
#define  MG1_8_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_8PL) || (G1_2PL == 0)
#define  MG1_8_12PL    ~(1 << 1)
#else
#define  MG1_8_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_8PL) || (G1_3PL == 0)
#define  MG1_8_13PL    ~(1 << 2)
#else
#define  MG1_8_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_8PL) || (G1_4PL == 0)
#define  MG1_8_14PL    ~(1 << 3)
#else
#define  MG1_8_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_8PL) || (G1_5PL == 0)
#define  MG1_8_15PL    ~(1 << 4)
#else
#define  MG1_8_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_8PL) || (G1_6PL == 0)
#define  MG1_8_16PL    ~(1 << 5)
#else
#define  MG1_8_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_8PL) || (G1_7PL == 0)
#define  MG1_8_17PL    ~(1 << 6)
#else
#define  MG1_8_17PL    0xFFFF
#endif

#if (G1_9PL >= G1_8PL) || (G1_9PL == 0)
#define  MG1_8_19PL    ~(1 << 8)
#else
#define  MG1_8_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_8PL) || (G1_10PL == 0)
#define  MG1_8_110PL    ~(1 << 9)
#else
#define  MG1_8_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_8PL) || (G1_11PL == 0)
#define  MG1_8_111PL    ~(1 << 10)
#else
#define  MG1_8_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_8PL) || (G1_12PL == 0)
#define  MG1_8_112PL    ~(1 << 11)
#else
#define  MG1_8_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_8PL) || (G1_13PL == 0)
#define  MG1_8_113PL    ~(1 << 12)
#else
#define  MG1_8_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_8PL) || (G1_14PL == 0)
#define  MG1_8_114PL    ~(1 << 13)
#else
#define  MG1_8_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_8PL) || (G1_15PL == 0)
#define  MG1_8_115PL    ~(1 << 14)
#else
#define  MG1_8_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_8PL) || (G1_16PL == 0)
#define  MG1_8_116PL    ~(1 << 15)
#else
#define  MG1_8_116PL    0xFFFF
#endif

#define  MG1_8_18PL	0xFF7F
#define  MG1_8    (MG1_8_11PL & MG1_8_12PL & MG1_8_13PL & MG1_8_14PL & \
                    MG1_8_15PL & MG1_8_16PL & MG1_8_17PL & MG1_8_18PL & \
                    MG1_8_19PL & MG1_8_110PL & MG1_8_111PL & MG1_8_112PL & \
                    MG1_8_113PL & MG1_8_114PL & MG1_8_115PL & MG1_8_116PL)
// End of MG1_8:
// Beginning of MG19:
#if (G1_1PL >= G1_9PL) || (G1_1PL == 0)
#define  MG1_9_11PL    ~(1 << 0)
#else
#define  MG1_9_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_9PL) || (G1_2PL == 0)
#define  MG1_9_12PL    ~(1 << 1)
#else
#define  MG1_9_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_9PL) || (G1_3PL == 0)
#define  MG1_9_13PL    ~(1 << 2)
#else
#define  MG1_9_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_9PL) || (G1_4PL == 0)
#define  MG1_9_14PL    ~(1 << 3)
#else
#define  MG1_9_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_9PL) || (G1_5PL == 0)
#define  MG1_9_15PL    ~(1 << 4)
#else
#define  MG1_9_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_9PL) || (G1_6PL == 0)
#define  MG1_9_16PL    ~(1 << 5)
#else
#define  MG1_9_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_9PL) || (G1_7PL == 0)
#define  MG1_9_17PL    ~(1 << 6)
#else
#define  MG1_9_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_9PL) || (G1_8PL == 0)
#define  MG1_9_18PL    ~(1 << 7)
#else
#define  MG1_9_18PL    0xFFFF
#endif

#if (G1_10PL >= G1_9PL) || (G1_10PL == 0)
#define  MG1_9_110PL    ~(1 << 9)
#else
#define  MG1_9_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_9PL) || (G1_11PL == 0)
#define  MG1_9_111PL    ~(1 << 10)
#else
#define  MG1_9_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_9PL) || (G1_12PL == 0)
#define  MG1_9_112PL    ~(1 << 11)
#else
#define  MG1_9_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_9PL) || (G1_13PL == 0)
#define  MG1_9_113PL    ~(1 << 12)
#else
#define  MG1_9_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_9PL) || (G1_14PL == 0)
#define  MG1_9_114PL    ~(1 << 13)
#else
#define  MG1_9_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_9PL) || (G1_15PL == 0)
#define  MG1_9_115PL    ~(1 << 14)
#else
#define  MG1_9_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_9PL) || (G1_16PL == 0)
#define  MG1_9_116PL    ~(1 << 15)
#else
#define  MG1_9_116PL    0xFFFF
#endif

#define  MG1_9_19PL	0xFEFF
#define  MG1_9    (MG1_9_11PL & MG1_9_12PL & MG1_9_13PL & MG1_9_14PL & \
                    MG1_9_15PL & MG1_9_16PL & MG1_9_17PL & MG1_9_18PL & \
                    MG1_9_19PL & MG1_9_110PL & MG1_9_111PL & MG1_9_112PL & \
                    MG1_9_113PL & MG1_9_114PL & MG1_9_115PL & MG1_9_116PL)
// End of MG1_9:
// Beginning of MG110:
#if (G1_1PL >= G1_10PL) || (G1_1PL == 0)
#define  MG1_10_11PL    ~(1 << 0)
#else
#define  MG1_10_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_10PL) || (G1_2PL == 0)
#define  MG1_10_12PL    ~(1 << 1)
#else
#define  MG1_10_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_10PL) || (G1_3PL == 0)
#define  MG1_10_13PL    ~(1 << 2)
#else
#define  MG1_10_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_10PL) || (G1_4PL == 0)
#define  MG1_10_14PL    ~(1 << 3)
#else
#define  MG1_10_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_10PL) || (G1_5PL == 0)
#define  MG1_10_15PL    ~(1 << 4)
#else
#define  MG1_10_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_10PL) || (G1_6PL == 0)
#define  MG1_10_16PL    ~(1 << 5)
#else
#define  MG1_10_16PL    0xFFFF
#endif

