UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples/boostxl_afe031_f28004x_rx/boostxl_afe031_f28004x_rx_isr.h
#if (G4_11PL >= G4_9PL) || (G4_11PL == 0)
#define  MG4_9_111PL    ~(1 << 10)
#else
#define  MG4_9_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_9PL) || (G4_12PL == 0)
#define  MG4_9_112PL    ~(1 << 11)
#else
#define  MG4_9_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_9PL) || (G4_13PL == 0)
#define  MG4_9_113PL    ~(1 << 12)
#else
#define  MG4_9_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_9PL) || (G4_14PL == 0)
#define  MG4_9_114PL    ~(1 << 13)
#else
#define  MG4_9_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_9PL) || (G4_15PL == 0)
#define  MG4_9_115PL    ~(1 << 14)
#else
#define  MG4_9_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_9PL) || (G4_16PL == 0)
#define  MG4_9_116PL    ~(1 << 15)
#else
#define  MG4_9_116PL    0xFFFF
#endif

#define  MG4_9_19PL	0xFEFF
#define  MG4_9    (MG4_9_11PL & MG4_9_12PL & MG4_9_13PL & MG4_9_14PL & \
                    MG4_9_15PL & MG4_9_16PL & MG4_9_17PL & MG4_9_18PL & \
                    MG4_9_19PL & MG4_9_110PL & MG4_9_111PL & MG4_9_112PL & \
                    MG4_9_113PL & MG4_9_114PL & MG4_9_115PL & MG4_9_116PL)
// End of MG4_9:
// Beginning of MG410:
#if (G4_1PL >= G4_10PL) || (G4_1PL == 0)
#define  MG4_10_11PL    ~(1 << 0)
#else
#define  MG4_10_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_10PL) || (G4_2PL == 0)
#define  MG4_10_12PL    ~(1 << 1)
#else
#define  MG4_10_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_10PL) || (G4_3PL == 0)
#define  MG4_10_13PL    ~(1 << 2)
#else
#define  MG4_10_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_10PL) || (G4_4PL == 0)
#define  MG4_10_14PL    ~(1 << 3)
#else
#define  MG4_10_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_10PL) || (G4_5PL == 0)
#define  MG4_10_15PL    ~(1 << 4)
#else
#define  MG4_10_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_10PL) || (G4_6PL == 0)
#define  MG4_10_16PL    ~(1 << 5)
#else
#define  MG4_10_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_10PL) || (G4_7PL == 0)
#define  MG4_10_17PL    ~(1 << 6)
#else
#define  MG4_10_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_10PL) || (G4_8PL == 0)
#define  MG4_10_18PL    ~(1 << 7)
#else
#define  MG4_10_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_10PL) || (G4_9PL == 0)
#define  MG4_10_19PL    ~(1 << 8)
#else
#define  MG4_10_19PL    0xFFFF
#endif

#if (G4_11PL >= G4_10PL) || (G4_11PL == 0)
#define  MG4_10_111PL    ~(1 << 10)
#else
#define  MG4_10_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_10PL) || (G4_12PL == 0)
#define  MG4_10_112PL    ~(1 << 11)
#else
#define  MG4_10_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_10PL) || (G4_13PL == 0)
#define  MG4_10_113PL    ~(1 << 12)
#else
#define  MG4_10_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_10PL) || (G4_14PL == 0)
#define  MG4_10_114PL    ~(1 << 13)
#else
#define  MG4_10_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_10PL) || (G4_15PL == 0)
#define  MG4_10_115PL    ~(1 << 14)
#else
#define  MG4_10_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_10PL) || (G4_16PL == 0)
#define  MG4_10_116PL    ~(1 << 15)
#else
#define  MG4_10_116PL    0xFFFF
#endif

#define  MG4_10_110PL	0xFDFF
#define  MG4_10    (MG4_10_11PL & MG4_10_12PL & MG4_10_13PL & MG4_10_14PL & \
                    MG4_10_15PL & MG4_10_16PL & MG4_10_17PL & MG4_10_18PL & \
                    MG4_10_19PL & MG4_10_110PL & MG4_10_111PL & MG4_10_112PL & \
                    MG4_10_113PL & MG4_10_114PL & MG4_10_115PL & MG4_10_116PL)
// End of MG4_10:
// Beginning of MG411:
#if (G4_1PL >= G4_11PL) || (G4_1PL == 0)
#define  MG4_11_11PL    ~(1 << 0)
#else
#define  MG4_11_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_11PL) || (G4_2PL == 0)
#define  MG4_11_12PL    ~(1 << 1)
#else
#define  MG4_11_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_11PL) || (G4_3PL == 0)
#define  MG4_11_13PL    ~(1 << 2)
#else
#define  MG4_11_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_11PL) || (G4_4PL == 0)
#define  MG4_11_14PL    ~(1 << 3)
#else
#define  MG4_11_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_11PL) || (G4_5PL == 0)
#define  MG4_11_15PL    ~(1 << 4)
#else
#define  MG4_11_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_11PL) || (G4_6PL == 0)
#define  MG4_11_16PL    ~(1 << 5)
#else
#define  MG4_11_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_11PL) || (G4_7PL == 0)
#define  MG4_11_17PL    ~(1 << 6)
#else
#define  MG4_11_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_11PL) || (G4_8PL == 0)
#define  MG4_11_18PL    ~(1 << 7)
#else
#define  MG4_11_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_11PL) || (G4_9PL == 0)
#define  MG4_11_19PL    ~(1 << 8)
#else
#define  MG4_11_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_11PL) || (G4_10PL == 0)
#define  MG4_11_110PL    ~(1 << 9)
#else
#define  MG4_11_110PL    0xFFFF
#endif

#if (G4_12PL >= G4_11PL) || (G4_12PL == 0)
#define  MG4_11_112PL    ~(1 << 11)
#else
#define  MG4_11_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_11PL) || (G4_13PL == 0)
#define  MG4_11_113PL    ~(1 << 12)
#else
#define  MG4_11_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_11PL) || (G4_14PL == 0)
#define  MG4_11_114PL    ~(1 << 13)
#else
#define  MG4_11_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_11PL) || (G4_15PL == 0)
#define  MG4_11_115PL    ~(1 << 14)
#else
#define  MG4_11_115PL    0xFFFF
#endif

#if (G4_16PL >= G4_11PL) || (G4_16PL == 0)
#define  MG4_11_116PL    ~(1 << 15)
#else
#define  MG4_11_116PL    0xFFFF
#endif

#define  MG4_11_111PL	0xFBFF
#define  MG4_11    (MG4_11_11PL & MG4_11_12PL & MG4_11_13PL & MG4_11_14PL & \
                    MG4_11_15PL & MG4_11_16PL & MG4_11_17PL & MG4_11_18PL & \
                    MG4_11_19PL & MG4_11_110PL & MG4_11_111PL & MG4_11_112PL & \
                    MG4_11_113PL & MG4_11_114PL & MG4_11_115PL & MG4_11_116PL)
// End of MG4_11:
// Beginning of MG412:
#if (G4_1PL >= G4_12PL) || (G4_1PL == 0)
#define  MG4_12_11PL    ~(1 << 0)
#else
#define  MG4_12_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_12PL) || (G4_2PL == 0)
#define  MG4_12_12PL    ~(1 << 1)
#else
#define  MG4_12_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_12PL) || (G4_3PL == 0)
#define  MG4_12_13PL    ~(1 << 2)
#else
#define  MG4_12_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_12PL) || (G4_4PL == 0)
#define  MG4_12_14PL    ~(1 << 3)
#else
#define  MG4_12_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_12PL) || (G4_5PL == 0)
#define  MG4_12_15PL    ~(1 << 4)
#else
#define  MG4_12_15PL    0xFFFF
#endif

