UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples/boostxl_afe031_f28004x_rx/boostxl_afe031_f28004x_rx_isr.h
#if (G5_11PL >= G5_5PL) || (G5_11PL == 0)
#define  MG5_5_111PL    ~(1 << 10)
#else
#define  MG5_5_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_5PL) || (G5_12PL == 0)
#define  MG5_5_112PL    ~(1 << 11)
#else
#define  MG5_5_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_5PL) || (G5_13PL == 0)
#define  MG5_5_113PL    ~(1 << 12)
#else
#define  MG5_5_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_5PL) || (G5_14PL == 0)
#define  MG5_5_114PL    ~(1 << 13)
#else
#define  MG5_5_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_5PL) || (G5_15PL == 0)
#define  MG5_5_115PL    ~(1 << 14)
#else
#define  MG5_5_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_5PL) || (G5_16PL == 0)
#define  MG5_5_116PL    ~(1 << 15)
#else
#define  MG5_5_116PL    0xFFFF
#endif

#define  MG5_5_15PL	0xFFEF
#define  MG5_5    (MG5_5_11PL & MG5_5_12PL & MG5_5_13PL & MG5_5_14PL & \
                    MG5_5_15PL & MG5_5_16PL & MG5_5_17PL & MG5_5_18PL & \
                    MG5_5_19PL & MG5_5_110PL & MG5_5_111PL & MG5_5_112PL & \
                    MG5_5_113PL & MG5_5_114PL & MG5_5_115PL & MG5_5_116PL)
// End of MG5_5:
// Beginning of MG56:
#if (G5_1PL >= G5_6PL) || (G5_1PL == 0)
#define  MG5_6_11PL    ~(1 << 0)
#else
#define  MG5_6_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_6PL) || (G5_2PL == 0)
#define  MG5_6_12PL    ~(1 << 1)
#else
#define  MG5_6_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_6PL) || (G5_3PL == 0)
#define  MG5_6_13PL    ~(1 << 2)
#else
#define  MG5_6_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_6PL) || (G5_4PL == 0)
#define  MG5_6_14PL    ~(1 << 3)
#else
#define  MG5_6_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_6PL) || (G5_5PL == 0)
#define  MG5_6_15PL    ~(1 << 4)
#else
#define  MG5_6_15PL    0xFFFF
#endif

#if (G5_7PL >= G5_6PL) || (G5_7PL == 0)
#define  MG5_6_17PL    ~(1 << 6)
#else
#define  MG5_6_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_6PL) || (G5_8PL == 0)
#define  MG5_6_18PL    ~(1 << 7)
#else
#define  MG5_6_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_6PL) || (G5_9PL == 0)
#define  MG5_6_19PL    ~(1 << 8)
#else
#define  MG5_6_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_6PL) || (G5_10PL == 0)
#define  MG5_6_110PL    ~(1 << 9)
#else
#define  MG5_6_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_6PL) || (G5_11PL == 0)
#define  MG5_6_111PL    ~(1 << 10)
#else
#define  MG5_6_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_6PL) || (G5_12PL == 0)
#define  MG5_6_112PL    ~(1 << 11)
#else
#define  MG5_6_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_6PL) || (G5_13PL == 0)
#define  MG5_6_113PL    ~(1 << 12)
#else
#define  MG5_6_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_6PL) || (G5_14PL == 0)
#define  MG5_6_114PL    ~(1 << 13)
#else
#define  MG5_6_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_6PL) || (G5_15PL == 0)
#define  MG5_6_115PL    ~(1 << 14)
#else
#define  MG5_6_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_6PL) || (G5_16PL == 0)
#define  MG5_6_116PL    ~(1 << 15)
#else
#define  MG5_6_116PL    0xFFFF
#endif

#define  MG5_6_16PL	0xFFDF
#define  MG5_6    (MG5_6_11PL & MG5_6_12PL & MG5_6_13PL & MG5_6_14PL & \
                    MG5_6_15PL & MG5_6_16PL & MG5_6_17PL & MG5_6_18PL & \
                    MG5_6_19PL & MG5_6_110PL & MG5_6_111PL & MG5_6_112PL & \
                    MG5_6_113PL & MG5_6_114PL & MG5_6_115PL & MG5_6_116PL)
// End of MG5_6:
// Beginning of MG57:
#if (G5_1PL >= G5_7PL) || (G5_1PL == 0)
#define  MG5_7_11PL    ~(1 << 0)
#else
#define  MG5_7_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_7PL) || (G5_2PL == 0)
#define  MG5_7_12PL    ~(1 << 1)
#else
#define  MG5_7_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_7PL) || (G5_3PL == 0)
#define  MG5_7_13PL    ~(1 << 2)
#else
#define  MG5_7_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_7PL) || (G5_4PL == 0)
#define  MG5_7_14PL    ~(1 << 3)
#else
#define  MG5_7_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_7PL) || (G5_5PL == 0)
#define  MG5_7_15PL    ~(1 << 4)
#else
#define  MG5_7_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_7PL) || (G5_6PL == 0)
#define  MG5_7_16PL    ~(1 << 5)
#else
#define  MG5_7_16PL    0xFFFF
#endif

#if (G5_8PL >= G5_7PL) || (G5_8PL == 0)
#define  MG5_7_18PL    ~(1 << 7)
#else
#define  MG5_7_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_7PL) || (G5_9PL == 0)
#define  MG5_7_19PL    ~(1 << 8)
#else
#define  MG5_7_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_7PL) || (G5_10PL == 0)
#define  MG5_7_110PL    ~(1 << 9)
#else
#define  MG5_7_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_7PL) || (G5_11PL == 0)
#define  MG5_7_111PL    ~(1 << 10)
#else
#define  MG5_7_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_7PL) || (G5_12PL == 0)
#define  MG5_7_112PL    ~(1 << 11)
#else
#define  MG5_7_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_7PL) || (G5_13PL == 0)
#define  MG5_7_113PL    ~(1 << 12)
#else
#define  MG5_7_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_7PL) || (G5_14PL == 0)
#define  MG5_7_114PL    ~(1 << 13)
#else
#define  MG5_7_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_7PL) || (G5_15PL == 0)
#define  MG5_7_115PL    ~(1 << 14)
#else
#define  MG5_7_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_7PL) || (G5_16PL == 0)
#define  MG5_7_116PL    ~(1 << 15)
#else
#define  MG5_7_116PL    0xFFFF
#endif

#define  MG5_7_17PL	0xFFBF
#define  MG5_7    (MG5_7_11PL & MG5_7_12PL & MG5_7_13PL & MG5_7_14PL & \
                    MG5_7_15PL & MG5_7_16PL & MG5_7_17PL & MG5_7_18PL & \
                    MG5_7_19PL & MG5_7_110PL & MG5_7_111PL & MG5_7_112PL & \
                    MG5_7_113PL & MG5_7_114PL & MG5_7_115PL & MG5_7_116PL)
// End of MG5_7:
// Beginning of MG58:
#if (G5_1PL >= G5_8PL) || (G5_1PL == 0)
#define  MG5_8_11PL    ~(1 << 0)
#else
#define  MG5_8_11PL    0xFFFF
#endif

#if (G5_2PL >= G5_8PL) || (G5_2PL == 0)
#define  MG5_8_12PL    ~(1 << 1)
#else
#define  MG5_8_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_8PL) || (G5_3PL == 0)
#define  MG5_8_13PL    ~(1 << 2)
#else
#define  MG5_8_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_8PL) || (G5_4PL == 0)
#define  MG5_8_14PL    ~(1 << 3)
#else
#define  MG5_8_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_8PL) || (G5_5PL == 0)
#define  MG5_8_15PL    ~(1 << 4)
#else
#define  MG5_8_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_8PL) || (G5_6PL == 0)
#define  MG5_8_16PL    ~(1 << 5)
#else
#define  MG5_8_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_8PL) || (G5_7PL == 0)
#define  MG5_8_17PL    ~(1 << 6)
#else
#define  MG5_8_17PL    0xFFFF
#endif

#if (G5_9PL >= G5_8PL) || (G5_9PL == 0)
#define  MG5_8_19PL    ~(1 << 8)
#else
#define  MG5_8_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_8PL) || (G5_10PL == 0)
#define  MG5_8_110PL    ~(1 << 9)
#else
#define  MG5_8_110PL    0xFFFF
#endif

