UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples/boostxl_afe031_f28004x_rx/boostxl_afe031_f28004x_rx_isr.h
#if (G6_3PL >= G6_5PL) || (G6_3PL == 0)
#define  MG6_5_13PL    ~(1 << 2)
#else
#define  MG6_5_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_5PL) || (G6_4PL == 0)
#define  MG6_5_14PL    ~(1 << 3)
#else
#define  MG6_5_14PL    0xFFFF
#endif

#if (G6_6PL >= G6_5PL) || (G6_6PL == 0)
#define  MG6_5_16PL    ~(1 << 5)
#else
#define  MG6_5_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_5PL) || (G6_7PL == 0)
#define  MG6_5_17PL    ~(1 << 6)
#else
#define  MG6_5_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_5PL) || (G6_8PL == 0)
#define  MG6_5_18PL    ~(1 << 7)
#else
#define  MG6_5_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_5PL) || (G6_9PL == 0)
#define  MG6_5_19PL    ~(1 << 8)
#else
#define  MG6_5_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_5PL) || (G6_10PL == 0)
#define  MG6_5_110PL    ~(1 << 9)
#else
#define  MG6_5_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_5PL) || (G6_11PL == 0)
#define  MG6_5_111PL    ~(1 << 10)
#else
#define  MG6_5_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_5PL) || (G6_12PL == 0)
#define  MG6_5_112PL    ~(1 << 11)
#else
#define  MG6_5_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_5PL) || (G6_13PL == 0)
#define  MG6_5_113PL    ~(1 << 12)
#else
#define  MG6_5_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_5PL) || (G6_14PL == 0)
#define  MG6_5_114PL    ~(1 << 13)
#else
#define  MG6_5_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_5PL) || (G6_15PL == 0)
#define  MG6_5_115PL    ~(1 << 14)
#else
#define  MG6_5_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_5PL) || (G6_16PL == 0)
#define  MG6_5_116PL    ~(1 << 15)
#else
#define  MG6_5_116PL    0xFFFF
#endif

#define  MG6_5_15PL	0xFFEF
#define  MG6_5    (MG6_5_11PL & MG6_5_12PL & MG6_5_13PL & MG6_5_14PL & \
                    MG6_5_15PL & MG6_5_16PL & MG6_5_17PL & MG6_5_18PL & \
                    MG6_5_19PL & MG6_5_110PL & MG6_5_111PL & MG6_5_112PL & \
                    MG6_5_113PL & MG6_5_114PL & MG6_5_115PL & MG6_5_116PL)
// End of MG6_5:
// Beginning of MG66:
#if (G6_1PL >= G6_6PL) || (G6_1PL == 0)
#define  MG6_6_11PL    ~(1 << 0)
#else
#define  MG6_6_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_6PL) || (G6_2PL == 0)
#define  MG6_6_12PL    ~(1 << 1)
#else
#define  MG6_6_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_6PL) || (G6_3PL == 0)
#define  MG6_6_13PL    ~(1 << 2)
#else
#define  MG6_6_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_6PL) || (G6_4PL == 0)
#define  MG6_6_14PL    ~(1 << 3)
#else
#define  MG6_6_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_6PL) || (G6_5PL == 0)
#define  MG6_6_15PL    ~(1 << 4)
#else
#define  MG6_6_15PL    0xFFFF
#endif

#if (G6_7PL >= G6_6PL) || (G6_7PL == 0)
#define  MG6_6_17PL    ~(1 << 6)
#else
#define  MG6_6_17PL    0xFFFF
#endif

#if (G6_8PL >= G6_6PL) || (G6_8PL == 0)
#define  MG6_6_18PL    ~(1 << 7)
#else
#define  MG6_6_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_6PL) || (G6_9PL == 0)
#define  MG6_6_19PL    ~(1 << 8)
#else
#define  MG6_6_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_6PL) || (G6_10PL == 0)
#define  MG6_6_110PL    ~(1 << 9)
#else
#define  MG6_6_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_6PL) || (G6_11PL == 0)
#define  MG6_6_111PL    ~(1 << 10)
#else
#define  MG6_6_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_6PL) || (G6_12PL == 0)
#define  MG6_6_112PL    ~(1 << 11)
#else
#define  MG6_6_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_6PL) || (G6_13PL == 0)
#define  MG6_6_113PL    ~(1 << 12)
#else
#define  MG6_6_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_6PL) || (G6_14PL == 0)
#define  MG6_6_114PL    ~(1 << 13)
#else
#define  MG6_6_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_6PL) || (G6_15PL == 0)
#define  MG6_6_115PL    ~(1 << 14)
#else
#define  MG6_6_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_6PL) || (G6_16PL == 0)
#define  MG6_6_116PL    ~(1 << 15)
#else
#define  MG6_6_116PL    0xFFFF
#endif

#define  MG6_6_16PL	0xFFDF
#define  MG6_6    (MG6_6_11PL & MG6_6_12PL & MG6_6_13PL & MG6_6_14PL & \
                    MG6_6_15PL & MG6_6_16PL & MG6_6_17PL & MG6_6_18PL & \
                    MG6_6_19PL & MG6_6_110PL & MG6_6_111PL & MG6_6_112PL & \
                    MG6_6_113PL & MG6_6_114PL & MG6_6_115PL & MG6_6_116PL)
// End of MG6_6:
// Beginning of MG67:
#if (G6_1PL >= G6_7PL) || (G6_1PL == 0)
#define  MG6_7_11PL    ~(1 << 0)
#else
#define  MG6_7_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_7PL) || (G6_2PL == 0)
#define  MG6_7_12PL    ~(1 << 1)
#else
#define  MG6_7_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_7PL) || (G6_3PL == 0)
#define  MG6_7_13PL    ~(1 << 2)
#else
#define  MG6_7_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_7PL) || (G6_4PL == 0)
#define  MG6_7_14PL    ~(1 << 3)
#else
#define  MG6_7_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_7PL) || (G6_5PL == 0)
#define  MG6_7_15PL    ~(1 << 4)
#else
#define  MG6_7_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_7PL) || (G6_6PL == 0)
#define  MG6_7_16PL    ~(1 << 5)
#else
#define  MG6_7_16PL    0xFFFF
#endif

#if (G6_8PL >= G6_7PL) || (G6_8PL == 0)
#define  MG6_7_18PL    ~(1 << 7)
#else
#define  MG6_7_18PL    0xFFFF
#endif

#if (G6_9PL >= G6_7PL) || (G6_9PL == 0)
#define  MG6_7_19PL    ~(1 << 8)
#else
#define  MG6_7_19PL    0xFFFF
#endif

#if (G6_10PL >= G6_7PL) || (G6_10PL == 0)
#define  MG6_7_110PL    ~(1 << 9)
#else
#define  MG6_7_110PL    0xFFFF
#endif

#if (G6_11PL >= G6_7PL) || (G6_11PL == 0)
#define  MG6_7_111PL    ~(1 << 10)
#else
#define  MG6_7_111PL    0xFFFF
#endif

#if (G6_12PL >= G6_7PL) || (G6_12PL == 0)
#define  MG6_7_112PL    ~(1 << 11)
#else
#define  MG6_7_112PL    0xFFFF
#endif

#if (G6_13PL >= G6_7PL) || (G6_13PL == 0)
#define  MG6_7_113PL    ~(1 << 12)
#else
#define  MG6_7_113PL    0xFFFF
#endif

#if (G6_14PL >= G6_7PL) || (G6_14PL == 0)
#define  MG6_7_114PL    ~(1 << 13)
#else
#define  MG6_7_114PL    0xFFFF
#endif

#if (G6_15PL >= G6_7PL) || (G6_15PL == 0)
#define  MG6_7_115PL    ~(1 << 14)
#else
#define  MG6_7_115PL    0xFFFF
#endif

#if (G6_16PL >= G6_7PL) || (G6_16PL == 0)
#define  MG6_7_116PL    ~(1 << 15)
#else
#define  MG6_7_116PL    0xFFFF
#endif

#define  MG6_7_17PL	0xFFBF
#define  MG6_7    (MG6_7_11PL & MG6_7_12PL & MG6_7_13PL & MG6_7_14PL & \
                    MG6_7_15PL & MG6_7_16PL & MG6_7_17PL & MG6_7_18PL & \
                    MG6_7_19PL & MG6_7_110PL & MG6_7_111PL & MG6_7_112PL & \
                    MG6_7_113PL & MG6_7_114PL & MG6_7_115PL & MG6_7_116PL)
// End of MG6_7:
// Beginning of MG68:
#if (G6_1PL >= G6_8PL) || (G6_1PL == 0)
#define  MG6_8_11PL    ~(1 << 0)
#else
#define  MG6_8_11PL    0xFFFF
#endif

#if (G6_2PL >= G6_8PL) || (G6_2PL == 0)
#define  MG6_8_12PL    ~(1 << 1)
#else
#define  MG6_8_12PL    0xFFFF
#endif

#if (G6_3PL >= G6_8PL) || (G6_3PL == 0)
#define  MG6_8_13PL    ~(1 << 2)
#else
#define  MG6_8_13PL    0xFFFF
#endif

#if (G6_4PL >= G6_8PL) || (G6_4PL == 0)
#define  MG6_8_14PL    ~(1 << 3)
#else
#define  MG6_8_14PL    0xFFFF
#endif

#if (G6_5PL >= G6_8PL) || (G6_5PL == 0)
#define  MG6_8_15PL    ~(1 << 4)
#else
#define  MG6_8_15PL    0xFFFF
#endif

#if (G6_6PL >= G6_8PL) || (G6_6PL == 0)
#define  MG6_8_16PL    ~(1 << 5)
#else
#define  MG6_8_16PL    0xFFFF
#endif

#if (G6_7PL >= G6_8PL) || (G6_7PL == 0)
#define  MG6_8_17PL    ~(1 << 6)
#else
#define  MG6_8_17PL    0xFFFF
#endif

#if (G6_9PL >= G6_8PL) || (G6_9PL == 0)
#define  MG6_8_19PL    ~(1 << 8)
#else
#define  MG6_8_19PL    0xFFFF
#endif

