UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples/boostxl_afe031_f28004x_rx/boostxl_afe031_f28004x_rx_isr.h
#if (G9_13PL >= G9_6PL) || (G9_13PL == 0)
#define  MG9_6_113PL    ~(1 << 12)
#else
#define  MG9_6_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_6PL) || (G9_14PL == 0)
#define  MG9_6_114PL    ~(1 << 13)
#else
#define  MG9_6_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_6PL) || (G9_15PL == 0)
#define  MG9_6_115PL    ~(1 << 14)
#else
#define  MG9_6_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_6PL) || (G9_16PL == 0)
#define  MG9_6_116PL    ~(1 << 15)
#else
#define  MG9_6_116PL    0xFFFF
#endif

#define  MG9_6_16PL	0xFFDF
#define  MG9_6    (MG9_6_11PL & MG9_6_12PL & MG9_6_13PL & MG9_6_14PL & \
                    MG9_6_15PL & MG9_6_16PL & MG9_6_17PL & MG9_6_18PL & \
                    MG9_6_19PL & MG9_6_110PL & MG9_6_111PL & MG9_6_112PL & \
                    MG9_6_113PL & MG9_6_114PL & MG9_6_115PL & MG9_6_116PL)
// End of MG9_6:
// Beginning of MG97:
#if (G9_1PL >= G9_7PL) || (G9_1PL == 0)
#define  MG9_7_11PL    ~(1 << 0)
#else
#define  MG9_7_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_7PL) || (G9_2PL == 0)
#define  MG9_7_12PL    ~(1 << 1)
#else
#define  MG9_7_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_7PL) || (G9_3PL == 0)
#define  MG9_7_13PL    ~(1 << 2)
#else
#define  MG9_7_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_7PL) || (G9_4PL == 0)
#define  MG9_7_14PL    ~(1 << 3)
#else
#define  MG9_7_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_7PL) || (G9_5PL == 0)
#define  MG9_7_15PL    ~(1 << 4)
#else
#define  MG9_7_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_7PL) || (G9_6PL == 0)
#define  MG9_7_16PL    ~(1 << 5)
#else
#define  MG9_7_16PL    0xFFFF
#endif

#if (G9_8PL >= G9_7PL) || (G9_8PL == 0)
#define  MG9_7_18PL    ~(1 << 7)
#else
#define  MG9_7_18PL    0xFFFF
#endif

#if (G9_9PL >= G9_7PL) || (G9_9PL == 0)
#define  MG9_7_19PL    ~(1 << 8)
#else
#define  MG9_7_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_7PL) || (G9_10PL == 0)
#define  MG9_7_110PL    ~(1 << 9)
#else
#define  MG9_7_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_7PL) || (G9_11PL == 0)
#define  MG9_7_111PL    ~(1 << 10)
#else
#define  MG9_7_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_7PL) || (G9_12PL == 0)
#define  MG9_7_112PL    ~(1 << 11)
#else
#define  MG9_7_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_7PL) || (G9_13PL == 0)
#define  MG9_7_113PL    ~(1 << 12)
#else
#define  MG9_7_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_7PL) || (G9_14PL == 0)
#define  MG9_7_114PL    ~(1 << 13)
#else
#define  MG9_7_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_7PL) || (G9_15PL == 0)
#define  MG9_7_115PL    ~(1 << 14)
#else
#define  MG9_7_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_7PL) || (G9_16PL == 0)
#define  MG9_7_116PL    ~(1 << 15)
#else
#define  MG9_7_116PL    0xFFFF
#endif

#define  MG9_7_17PL	0xFFBF
#define  MG9_7    (MG9_7_11PL & MG9_7_12PL & MG9_7_13PL & MG9_7_14PL & \
                    MG9_7_15PL & MG9_7_16PL & MG9_7_17PL & MG9_7_18PL & \
                    MG9_7_19PL & MG9_7_110PL & MG9_7_111PL & MG9_7_112PL & \
                    MG9_7_113PL & MG9_7_114PL & MG9_7_115PL & MG9_7_116PL)
// End of MG9_7:
// Beginning of MG98:
#if (G9_1PL >= G9_8PL) || (G9_1PL == 0)
#define  MG9_8_11PL    ~(1 << 0)
#else
#define  MG9_8_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_8PL) || (G9_2PL == 0)
#define  MG9_8_12PL    ~(1 << 1)
#else
#define  MG9_8_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_8PL) || (G9_3PL == 0)
#define  MG9_8_13PL    ~(1 << 2)
#else
#define  MG9_8_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_8PL) || (G9_4PL == 0)
#define  MG9_8_14PL    ~(1 << 3)
#else
#define  MG9_8_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_8PL) || (G9_5PL == 0)
#define  MG9_8_15PL    ~(1 << 4)
#else
#define  MG9_8_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_8PL) || (G9_6PL == 0)
#define  MG9_8_16PL    ~(1 << 5)
#else
#define  MG9_8_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_8PL) || (G9_7PL == 0)
#define  MG9_8_17PL    ~(1 << 6)
#else
#define  MG9_8_17PL    0xFFFF
#endif

#if (G9_9PL >= G9_8PL) || (G9_9PL == 0)
#define  MG9_8_19PL    ~(1 << 8)
#else
#define  MG9_8_19PL    0xFFFF
#endif

#if (G9_10PL >= G9_8PL) || (G9_10PL == 0)
#define  MG9_8_110PL    ~(1 << 9)
#else
#define  MG9_8_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_8PL) || (G9_11PL == 0)
#define  MG9_8_111PL    ~(1 << 10)
#else
#define  MG9_8_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_8PL) || (G9_12PL == 0)
#define  MG9_8_112PL    ~(1 << 11)
#else
#define  MG9_8_112PL    0xFFFF
#endif

#if (G9_13PL >= G9_8PL) || (G9_13PL == 0)
#define  MG9_8_113PL    ~(1 << 12)
#else
#define  MG9_8_113PL    0xFFFF
#endif

#if (G9_14PL >= G9_8PL) || (G9_14PL == 0)
#define  MG9_8_114PL    ~(1 << 13)
#else
#define  MG9_8_114PL    0xFFFF
#endif

#if (G9_15PL >= G9_8PL) || (G9_15PL == 0)
#define  MG9_8_115PL    ~(1 << 14)
#else
#define  MG9_8_115PL    0xFFFF
#endif

#if (G9_16PL >= G9_8PL) || (G9_16PL == 0)
#define  MG9_8_116PL    ~(1 << 15)
#else
#define  MG9_8_116PL    0xFFFF
#endif

#define  MG9_8_18PL	0xFF7F
#define  MG9_8    (MG9_8_11PL & MG9_8_12PL & MG9_8_13PL & MG9_8_14PL & \
                    MG9_8_15PL & MG9_8_16PL & MG9_8_17PL & MG9_8_18PL & \
                    MG9_8_19PL & MG9_8_110PL & MG9_8_111PL & MG9_8_112PL & \
                    MG9_8_113PL & MG9_8_114PL & MG9_8_115PL & MG9_8_116PL)
// End of MG9_8:
// Beginning of MG99:
#if (G9_1PL >= G9_9PL) || (G9_1PL == 0)
#define  MG9_9_11PL    ~(1 << 0)
#else
#define  MG9_9_11PL    0xFFFF
#endif

#if (G9_2PL >= G9_9PL) || (G9_2PL == 0)
#define  MG9_9_12PL    ~(1 << 1)
#else
#define  MG9_9_12PL    0xFFFF
#endif

#if (G9_3PL >= G9_9PL) || (G9_3PL == 0)
#define  MG9_9_13PL    ~(1 << 2)
#else
#define  MG9_9_13PL    0xFFFF
#endif

#if (G9_4PL >= G9_9PL) || (G9_4PL == 0)
#define  MG9_9_14PL    ~(1 << 3)
#else
#define  MG9_9_14PL    0xFFFF
#endif

#if (G9_5PL >= G9_9PL) || (G9_5PL == 0)
#define  MG9_9_15PL    ~(1 << 4)
#else
#define  MG9_9_15PL    0xFFFF
#endif

#if (G9_6PL >= G9_9PL) || (G9_6PL == 0)
#define  MG9_9_16PL    ~(1 << 5)
#else
#define  MG9_9_16PL    0xFFFF
#endif

#if (G9_7PL >= G9_9PL) || (G9_7PL == 0)
#define  MG9_9_17PL    ~(1 << 6)
#else
#define  MG9_9_17PL    0xFFFF
#endif

#if (G9_8PL >= G9_9PL) || (G9_8PL == 0)
#define  MG9_9_18PL    ~(1 << 7)
#else
#define  MG9_9_18PL    0xFFFF
#endif

#if (G9_10PL >= G9_9PL) || (G9_10PL == 0)
#define  MG9_9_110PL    ~(1 << 9)
#else
#define  MG9_9_110PL    0xFFFF
#endif

#if (G9_11PL >= G9_9PL) || (G9_11PL == 0)
#define  MG9_9_111PL    ~(1 << 10)
#else
#define  MG9_9_111PL    0xFFFF
#endif

#if (G9_12PL >= G9_9PL) || (G9_12PL == 0)
#define  MG9_9_112PL    ~(1 << 11)
#else
#define  MG9_9_112PL    0xFFFF
#endif

