UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples/boostxl_afe031_f28004x_rx/boostxl_afe031_f28004x_rx_isr.h
#if (G10_10PL >= G10_3PL) || (G10_10PL == 0)
#define  MG10_3_110PL    ~(1 << 9)
#else
#define  MG10_3_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_3PL) || (G10_11PL == 0)
#define  MG10_3_111PL    ~(1 << 10)
#else
#define  MG10_3_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_3PL) || (G10_12PL == 0)
#define  MG10_3_112PL    ~(1 << 11)
#else
#define  MG10_3_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_3PL) || (G10_13PL == 0)
#define  MG10_3_113PL    ~(1 << 12)
#else
#define  MG10_3_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_3PL) || (G10_14PL == 0)
#define  MG10_3_114PL    ~(1 << 13)
#else
#define  MG10_3_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_3PL) || (G10_15PL == 0)
#define  MG10_3_115PL    ~(1 << 14)
#else
#define  MG10_3_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_3PL) || (G10_16PL == 0)
#define  MG10_3_116PL    ~(1 << 15)
#else
#define  MG10_3_116PL    0xFFFF
#endif

#define  MG10_3_13PL	0xFFFB
#define  MG10_3    (MG10_3_11PL & MG10_3_12PL & MG10_3_13PL & MG10_3_14PL & \
                    MG10_3_15PL & MG10_3_16PL & MG10_3_17PL & MG10_3_18PL & \
                    MG10_3_19PL & MG10_3_110PL & MG10_3_111PL & MG10_3_112PL & \
                    MG10_3_113PL & MG10_3_114PL & MG10_3_115PL & MG10_3_116PL)
// End of MG10_3:
// Beginning of MG104:
#if (G10_1PL >= G10_4PL) || (G10_1PL == 0)
#define  MG10_4_11PL    ~(1 << 0)
#else
#define  MG10_4_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_4PL) || (G10_2PL == 0)
#define  MG10_4_12PL    ~(1 << 1)
#else
#define  MG10_4_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_4PL) || (G10_3PL == 0)
#define  MG10_4_13PL    ~(1 << 2)
#else
#define  MG10_4_13PL    0xFFFF
#endif

#if (G10_5PL >= G10_4PL) || (G10_5PL == 0)
#define  MG10_4_15PL    ~(1 << 4)
#else
#define  MG10_4_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_4PL) || (G10_6PL == 0)
#define  MG10_4_16PL    ~(1 << 5)
#else
#define  MG10_4_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_4PL) || (G10_7PL == 0)
#define  MG10_4_17PL    ~(1 << 6)
#else
#define  MG10_4_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_4PL) || (G10_8PL == 0)
#define  MG10_4_18PL    ~(1 << 7)
#else
#define  MG10_4_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_4PL) || (G10_9PL == 0)
#define  MG10_4_19PL    ~(1 << 8)
#else
#define  MG10_4_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_4PL) || (G10_10PL == 0)
#define  MG10_4_110PL    ~(1 << 9)
#else
#define  MG10_4_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_4PL) || (G10_11PL == 0)
#define  MG10_4_111PL    ~(1 << 10)
#else
#define  MG10_4_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_4PL) || (G10_12PL == 0)
#define  MG10_4_112PL    ~(1 << 11)
#else
#define  MG10_4_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_4PL) || (G10_13PL == 0)
#define  MG10_4_113PL    ~(1 << 12)
#else
#define  MG10_4_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_4PL) || (G10_14PL == 0)
#define  MG10_4_114PL    ~(1 << 13)
#else
#define  MG10_4_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_4PL) || (G10_15PL == 0)
#define  MG10_4_115PL    ~(1 << 14)
#else
#define  MG10_4_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_4PL) || (G10_16PL == 0)
#define  MG10_4_116PL    ~(1 << 15)
#else
#define  MG10_4_116PL    0xFFFF
#endif

#define  MG10_4_14PL	0xFFF7
#define  MG10_4    (MG10_4_11PL & MG10_4_12PL & MG10_4_13PL & MG10_4_14PL & \
                    MG10_4_15PL & MG10_4_16PL & MG10_4_17PL & MG10_4_18PL & \
                    MG10_4_19PL & MG10_4_110PL & MG10_4_111PL & MG10_4_112PL & \
                    MG10_4_113PL & MG10_4_114PL & MG10_4_115PL & MG10_4_116PL)
// End of MG10_4:
// Beginning of MG105:
#if (G10_1PL >= G10_5PL) || (G10_1PL == 0)
#define  MG10_5_11PL    ~(1 << 0)
#else
#define  MG10_5_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_5PL) || (G10_2PL == 0)
#define  MG10_5_12PL    ~(1 << 1)
#else
#define  MG10_5_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_5PL) || (G10_3PL == 0)
#define  MG10_5_13PL    ~(1 << 2)
#else
#define  MG10_5_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_5PL) || (G10_4PL == 0)
#define  MG10_5_14PL    ~(1 << 3)
#else
#define  MG10_5_14PL    0xFFFF
#endif

#if (G10_6PL >= G10_5PL) || (G10_6PL == 0)
#define  MG10_5_16PL    ~(1 << 5)
#else
#define  MG10_5_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_5PL) || (G10_7PL == 0)
#define  MG10_5_17PL    ~(1 << 6)
#else
#define  MG10_5_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_5PL) || (G10_8PL == 0)
#define  MG10_5_18PL    ~(1 << 7)
#else
#define  MG10_5_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_5PL) || (G10_9PL == 0)
#define  MG10_5_19PL    ~(1 << 8)
#else
#define  MG10_5_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_5PL) || (G10_10PL == 0)
#define  MG10_5_110PL    ~(1 << 9)
#else
#define  MG10_5_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_5PL) || (G10_11PL == 0)
#define  MG10_5_111PL    ~(1 << 10)
#else
#define  MG10_5_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_5PL) || (G10_12PL == 0)
#define  MG10_5_112PL    ~(1 << 11)
#else
#define  MG10_5_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_5PL) || (G10_13PL == 0)
#define  MG10_5_113PL    ~(1 << 12)
#else
#define  MG10_5_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_5PL) || (G10_14PL == 0)
#define  MG10_5_114PL    ~(1 << 13)
#else
#define  MG10_5_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_5PL) || (G10_15PL == 0)
#define  MG10_5_115PL    ~(1 << 14)
#else
#define  MG10_5_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_5PL) || (G10_16PL == 0)
#define  MG10_5_116PL    ~(1 << 15)
#else
#define  MG10_5_116PL    0xFFFF
#endif

#define  MG10_5_15PL	0xFFEF
#define  MG10_5    (MG10_5_11PL & MG10_5_12PL & MG10_5_13PL & MG10_5_14PL & \
                    MG10_5_15PL & MG10_5_16PL & MG10_5_17PL & MG10_5_18PL & \
                    MG10_5_19PL & MG10_5_110PL & MG10_5_111PL & MG10_5_112PL & \
                    MG10_5_113PL & MG10_5_114PL & MG10_5_115PL & MG10_5_116PL)
// End of MG10_5:
// Beginning of MG106:
#if (G10_1PL >= G10_6PL) || (G10_1PL == 0)
#define  MG10_6_11PL    ~(1 << 0)
#else
#define  MG10_6_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_6PL) || (G10_2PL == 0)
#define  MG10_6_12PL    ~(1 << 1)
#else
#define  MG10_6_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_6PL) || (G10_3PL == 0)
#define  MG10_6_13PL    ~(1 << 2)
#else
#define  MG10_6_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_6PL) || (G10_4PL == 0)
#define  MG10_6_14PL    ~(1 << 3)
#else
#define  MG10_6_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_6PL) || (G10_5PL == 0)
#define  MG10_6_15PL    ~(1 << 4)
#else
#define  MG10_6_15PL    0xFFFF
#endif

#if (G10_7PL >= G10_6PL) || (G10_7PL == 0)
#define  MG10_6_17PL    ~(1 << 6)
#else
#define  MG10_6_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_6PL) || (G10_8PL == 0)
#define  MG10_6_18PL    ~(1 << 7)
#else
#define  MG10_6_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_6PL) || (G10_9PL == 0)
#define  MG10_6_19PL    ~(1 << 8)
#else
#define  MG10_6_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_6PL) || (G10_10PL == 0)
#define  MG10_6_110PL    ~(1 << 9)
#else
#define  MG10_6_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_6PL) || (G10_11PL == 0)
#define  MG10_6_111PL    ~(1 << 10)
#else
#define  MG10_6_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_6PL) || (G10_12PL == 0)
#define  MG10_6_112PL    ~(1 << 11)
#else
#define  MG10_6_112PL    0xFFFF
#endif

