UOSupermileage/BLDC-F280049C/ti-f28004x-resources-and-examples/examples/boostxl_afe031_f28004x_rx/boostxl_afe031_f28004x_rx_isr.h
#if (G11_7PL >= G11_16PL) || (G11_7PL == 0)
#define  MG11_16_17PL    ~(1 << 6)
#else
#define  MG11_16_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_16PL) || (G11_8PL == 0)
#define  MG11_16_18PL    ~(1 << 7)
#else
#define  MG11_16_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_16PL) || (G11_9PL == 0)
#define  MG11_16_19PL    ~(1 << 8)
#else
#define  MG11_16_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_16PL) || (G11_10PL == 0)
#define  MG11_16_110PL    ~(1 << 9)
#else
#define  MG11_16_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_16PL) || (G11_11PL == 0)
#define  MG11_16_111PL    ~(1 << 10)
#else
#define  MG11_16_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_16PL) || (G11_12PL == 0)
#define  MG11_16_112PL    ~(1 << 11)
#else
#define  MG11_16_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_16PL) || (G11_13PL == 0)
#define  MG11_16_113PL    ~(1 << 12)
#else
#define  MG11_16_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_16PL) || (G11_14PL == 0)
#define  MG11_16_114PL    ~(1 << 13)
#else
#define  MG11_16_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_16PL) || (G11_15PL == 0)
#define  MG11_16_115PL    ~(1 << 14)
#else
#define  MG11_16_115PL    0xFFFF
#endif

#define  MG11_16_116PL	0x7FFF
#define  MG11_16    (MG11_16_11PL & MG11_16_12PL & MG11_16_13PL & MG11_16_14PL & \
                    MG11_16_15PL & MG11_16_16PL & MG11_16_17PL & MG11_16_18PL & \
                    MG11_16_19PL & MG11_16_110PL & MG11_16_111PL & MG11_16_112PL & \
                    MG11_16_113PL & MG11_16_114PL & MG11_16_115PL & MG11_16_116PL)
// End of MG11_16:


//
// Automatically generate PIEIER12 interrupt masks MG121 to MG1216:
//

// Beginning of MG121:
#if (G12_2PL >= G12_1PL) || (G12_2PL == 0)
#define  MG12_1_12PL    ~(1 << 1)
#else
#define  MG12_1_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_1PL) || (G12_3PL == 0)
#define  MG12_1_13PL    ~(1 << 2)
#else
#define  MG12_1_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_1PL) || (G12_4PL == 0)
#define  MG12_1_14PL    ~(1 << 3)
#else
#define  MG12_1_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_1PL) || (G12_5PL == 0)
#define  MG12_1_15PL    ~(1 << 4)
#else
#define  MG12_1_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_1PL) || (G12_6PL == 0)
#define  MG12_1_16PL    ~(1 << 5)
#else
#define  MG12_1_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_1PL) || (G12_7PL == 0)
#define  MG12_1_17PL    ~(1 << 6)
#else
#define  MG12_1_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_1PL) || (G12_8PL == 0)
#define  MG12_1_18PL    ~(1 << 7)
#else
#define  MG12_1_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_1PL) || (G12_9PL == 0)
#define  MG12_1_19PL    ~(1 << 8)
#else
#define  MG12_1_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_1PL) || (G12_10PL == 0)
#define  MG12_1_110PL    ~(1 << 9)
#else
#define  MG12_1_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_1PL) || (G12_11PL == 0)
#define  MG12_1_111PL    ~(1 << 10)
#else
#define  MG12_1_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_1PL) || (G12_12PL == 0)
#define  MG12_1_112PL    ~(1 << 11)
#else
#define  MG12_1_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_1PL) || (G12_13PL == 0)
#define  MG12_1_113PL    ~(1 << 12)
#else
#define  MG12_1_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_1PL) || (G12_14PL == 0)
#define  MG12_1_114PL    ~(1 << 13)
#else
#define  MG12_1_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_1PL) || (G12_15PL == 0)
#define  MG12_1_115PL    ~(1 << 14)
#else
#define  MG12_1_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_1PL) || (G12_16PL == 0)
#define  MG12_1_116PL    ~(1 << 15)
#else
#define  MG12_1_116PL    0xFFFF
#endif

#define  MG12_1_11PL	0xFFFE
#define  MG12_1    (MG12_1_11PL & MG12_1_12PL & MG12_1_13PL & MG12_1_14PL & \
                    MG12_1_15PL & MG12_1_16PL & MG12_1_17PL & MG12_1_18PL & \
                    MG12_1_19PL & MG12_1_110PL & MG12_1_111PL & MG12_1_112PL & \
                    MG12_1_113PL & MG12_1_114PL & MG12_1_115PL & MG12_1_116PL)
// End of MG12_1:
// Beginning of MG122:
#if (G12_1PL >= G12_2PL) || (G12_1PL == 0)
#define  MG12_2_11PL    ~(1 << 0)
#else
#define  MG12_2_11PL    0xFFFF
#endif

#if (G12_3PL >= G12_2PL) || (G12_3PL == 0)
#define  MG12_2_13PL    ~(1 << 2)
#else
#define  MG12_2_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_2PL) || (G12_4PL == 0)
#define  MG12_2_14PL    ~(1 << 3)
#else
#define  MG12_2_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_2PL) || (G12_5PL == 0)
#define  MG12_2_15PL    ~(1 << 4)
#else
#define  MG12_2_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_2PL) || (G12_6PL == 0)
#define  MG12_2_16PL    ~(1 << 5)
#else
#define  MG12_2_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_2PL) || (G12_7PL == 0)
#define  MG12_2_17PL    ~(1 << 6)
#else
#define  MG12_2_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_2PL) || (G12_8PL == 0)
#define  MG12_2_18PL    ~(1 << 7)
#else
#define  MG12_2_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_2PL) || (G12_9PL == 0)
#define  MG12_2_19PL    ~(1 << 8)
#else
#define  MG12_2_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_2PL) || (G12_10PL == 0)
#define  MG12_2_110PL    ~(1 << 9)
#else
#define  MG12_2_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_2PL) || (G12_11PL == 0)
#define  MG12_2_111PL    ~(1 << 10)
#else
#define  MG12_2_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_2PL) || (G12_12PL == 0)
#define  MG12_2_112PL    ~(1 << 11)
#else
#define  MG12_2_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_2PL) || (G12_13PL == 0)
#define  MG12_2_113PL    ~(1 << 12)
#else
#define  MG12_2_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_2PL) || (G12_14PL == 0)
#define  MG12_2_114PL    ~(1 << 13)
#else
#define  MG12_2_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_2PL) || (G12_15PL == 0)
#define  MG12_2_115PL    ~(1 << 14)
#else
#define  MG12_2_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_2PL) || (G12_16PL == 0)
#define  MG12_2_116PL    ~(1 << 15)
#else
#define  MG12_2_116PL    0xFFFF
#endif

#define  MG12_2_12PL	0xFFFD
#define  MG12_2    (MG12_2_11PL & MG12_2_12PL & MG12_2_13PL & MG12_2_14PL & \
                    MG12_2_15PL & MG12_2_16PL & MG12_2_17PL & MG12_2_18PL & \
                    MG12_2_19PL & MG12_2_110PL & MG12_2_111PL & MG12_2_112PL & \
                    MG12_2_113PL & MG12_2_114PL & MG12_2_115PL & MG12_2_116PL)
// End of MG12_2:
// Beginning of MG123:
#if (G12_1PL >= G12_3PL) || (G12_1PL == 0)
#define  MG12_3_11PL    ~(1 << 0)
#else
#define  MG12_3_11PL    0xFFFF
#endif

